export const useSymbol = () => {
  return {
    getSymbolArray: (character: string): string[] => {
      switch (character) {
        case 'a':
          return ['a', 'ɑ', 'α', 'а', 'ａ', '𝒶', '𝓪', '𝔞', '𝕒', '𝖺', '⍺', 'ᴀ', 'ӓ', 'ა', 'ả', 'ấ', 'ầ', 'ẩ', 'ẫ']
        case 'b':
          return ['b','Ƅ','ɓ','Ь','б','ь','ъ','ｂ','𝐛','𝑏','𝒃','𝓫','𝔟','𝕓','𝖇','𝗯','𝘣','𝙗','𝚋']
        case 'c':
          return ['c', 'ɔ', 'ϲ', 'с', 'ς', 'ć', 'č', 'ç', 'ｃ', '𝐜', '𝑐', '𝒄', '𝓬', '𝔠', '𝕔', '𝖈', '𝗰', '𝘤', '𝙘', '𝚌']
        case 'd':
          return ['d', 'ď', 'đ', 'ɖ', 'ɗ', 'ԁ', 'ｄ', '𝐝', '𝑑', '𝒅', '𝓭', '𝔡', '𝕕', '𝖉', '𝗱', '𝘥', '𝙙']
        case 'e':
          return ['e', 'є', 'έ', 'ε', 'ҽ', 'э', 'ё', 'Є', 'е', 'ҿ', 'ӭ', 'ｅ', '𝐞', '𝑒', '𝒆', '𝓮', '𝔢', '𝕖', '𝖊', '𝗲', '𝘦', '𝙚']
        case 'f':
          return ['f', 'ſ', 'ƒ', 'ᶠ', 'ғ', 'ｆ', '𝐟', '𝑓', '𝒇', '𝓯', '𝔣', '𝕗', '𝖋', '𝗳', '𝘧', '𝙛', '𝚏']
        case 'g':
          return ['g', 'ɡ', 'ց', 'ᶃ', 'ɢ', 'ɠ', 'ǥ', 'ɡ̈', 'ｇ', '𝐠', '𝑔', '𝒈', '𝓰', '𝔤', '𝕘', '𝖌', '𝗴', '𝘨', '𝙜', '𝚐']
        case 'h':
          return ['h', 'һ', 'հ', 'ɦ', 'н', 'Ꮒ', 'ḥ', 'ҥ', 'ӈ', 'ի', 'ｈ', '𝐡', '𝒉', '𝓱', '𝔥', '𝕙', '𝖍', '𝗵', '𝘩', '𝙝', '𝚑']
        case 'i':
          return ['i', 'ı', 'į', 'ī', 'ï', 'í', 'і', 'ɪ', 'ǐ', 'ɨ', 'ỉ', 'ì', 'ｉ', '𝐢', '𝑖', '𝒊', '𝓲', '𝔦', '𝕚', '𝖎', '𝗶', '𝘪', '𝙞']
        case 'j':
          return ['j', 'ɉ', 'ĵ', 'ǰ', 'Ј', 'ј', 'ｊ', '𝐣', '𝑗', '𝒋', '𝓳', '𝔧', '𝕛', '𝖏', '𝗷', '𝘫', '𝙟', '𝚓']
        case 'k':
          return ['k', 'ķ', 'ĸ', 'к', 'қ', 'ҝ', 'ҟ', 'ӄ', 'κ', 'к', 'ƙ', 'ｋ', '𝐤', '𝑘', '𝒋', '𝓴', '𝔨', '𝕜', '𝖐', '𝗸', '𝘬', '𝙠']
        case 'l':
          return ['l', 'ӏ', 'ı', '|', 'ɩ', 'ŀ', 'ĺ', 'ļ', 'ł', '1', 'Ɩ', 'ɭ', 'ȴ', 'ｌ', '𝐥', '𝑙', '𝒍', '𝓵', '𝔩', '𝕝', '𝖑', '𝗹', '𝘭', '𝙡']
        case 'm':
          return ['m', 'м', 'ᴍ', 'ḿ', 'ṁ', 'ṃ', 'м', 'ɱ', 'ӎ', 'რ', 'ｍ', '𝐦', '𝑚', '𝒎', '𝓶', '𝔪', '𝕞', '𝖒', '𝗺', '𝘮', '𝙢', '𝚖']
        case 'n':
          return [, 'n', 'ո', 'ɴ', 'ń', 'ņ', 'ň', 'ñ', 'ռ', 'ｎ', '𝐧', '𝑛', '𝒏', '𝓷', '𝔫', '𝕟', '𝖓', '𝗻', '𝘯', '𝙣', '𝚗']
        case 'o':
          return ['o', 'о', 'օ', 'ჿ', 'ɵ', 'ӧ', 'ọ', 'ỏ', 'ố', 'ồ', 'ổ', 'ỗ', 'ộ', 'ǫ', 'ｏ', '𝐨', '𝑜', '𝒐', '𝓸', '𝔬', '𝕠', '𝖔', '𝗼', '𝘰', '𝙤']
        case 'p':
          return [, 'p', 'р', 'ｐ', '𝐩', '𝑝', '𝒑', '𝓹', '𝔭', '𝕡', '𝖕', '𝗽', '𝘱', '𝙥', '𝚙', 'þ', 'ṕ', 'ṗ', 'ƿ', 'ρ', 'þ']
        case 'q':
          return [, 'q', 'զ', 'ԛ', 'գ', 'ｑ', '𝐪', '𝑞', '𝒒', '𝓺', '𝔮', '𝕢', '𝖖', '𝗾', '𝘲', '𝙦', '𝚚', 'ɋ', 'ʠ']
        case 'r':
          return ['r', 'ŕ', 'ř', 'ŗ', 'ȑ', 'ȓ', 'г', 'ґ', 'ｒ', '𝐫', '𝑟', '𝒓', '𝓻', '𝔯', '𝕣', '𝖗', '𝗿', '𝘳', '𝙧']
        case 's':
          return ['s', 'ŝ', 'ş', 'š', 'ș', 'ʂ', 'ȿ', 'ѕ', 'ս', 'ｓ', '𝐬', '𝑠', '𝒔', '𝓼', '𝔰', '𝕤', '𝖘', '𝗌', '𝘴', '𝙨']
        case 't':
          return ['t', 'ť', 'ţ', 'ț', 'ƫ', 'ȶ', 'т', 'ҭ', 'ե', 'է', 'ｔ', '𝐭', '𝑡', '𝒕', '𝓽', '𝔱', '𝕥', '𝖙', '𝗍', '𝘵', '𝙩']
        case 'u':
          return ['u', 'ŭ', 'ů', 'ų', 'ư', 'ʉ', 'ｕ', '𝐮', '𝑢', '𝒖', '𝓾', '𝔲', '𝕦', '𝖚', '𝗎', '𝘶', '𝙪', '𝚞', 'ս']
        case 'v':
          return ['v', 'ν', 'ѵ', 'ʋ', 'ѷ', 'ｖ', '𝐯', '𝑣', '𝒗', '𝓿', '𝔳', '𝕧', '𝖛', '𝗏', '𝘷', '𝙫', '𝚟']
        case 'w':
          return ['w', 'ѡ', 'ԝ', 'ա', 'ẁ', 'ẃ', 'ẅ', 'ẇ', 'ẉ', 'ẘ', 'ｗ', '𝐰', '𝑤', '𝒘', '𝓌', '𝔴', '𝕨', '𝖜', '𝗐', '𝘄', '𝙬']
        case 'x':
          return ['x', 'χ', 'х', 'ҳ', 'ӽ', 'ｘ', '𝐱', '𝑥', '𝒙', '𝓍', '𝔵', '𝕩', '𝖝', '𝗑', '𝘅', '𝙭', '𝚡', '×']
        case 'y':
          return ['y', 'ý', 'ÿ', 'ỹ', 'ỳ', 'ӯ', 'ү', 'ұ', 'ყ', 'ў', 'ｙ', '𝐲', '𝑦', '𝒚', '𝓎', '𝔶', '𝕪', '𝖞', '𝗒', '𝘆', '𝙮']
        case 'z':
          return ['z', 'ż', 'ž', 'ƶ', 'ȥ', 'ɀ', 'ʐ', 'ʑ', 'ӡ', 'ჳ', 'ｚ', '𝐳', '𝑧', '𝒛', '𝓏', '𝔷', '𝕫', '𝖟', '𝗓', '𝘇', '𝙯']
        default:
          return []
      }
    }
  }
}
